Thanks for the issue. This is a problem caused by API changes. We will contact the relevant team and try to find the most suitable solution. Before that, the following workaround can be used as alternatives:
```hcl
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}


resource "fortios_firewall_sslsshprofile" "trname" {
  name             = "test"
  server_cert      = "\"Fortinet_Factory\""
  server_cert_mode = "replace"

  ssl {
    inspect_all = "deep-inspection"
  }

  ssh {
    status = "disable"
  }

  https {
    ports = 443
  }
}

```

```
# terraform apply
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_sslsshprofile.trname will be created
  + resource "fortios_firewall_sslsshprofile" "trname" {
      + allowlist                      = (known after apply)
      + block_blacklisted_certificates = (known after apply)
      + block_blocklisted_certificates = (known after apply)
      + caname                         = (known after apply)
      + dynamic_sort_subtable          = "false"
      + id                             = (known after apply)
      + mapi_over_https                = (known after apply)
      + name                           = "test"
      + rpc_over_https                 = (known after apply)
      + server_cert                    = "\"Fortinet_Factory\""
      + server_cert_mode               = "replace"
      + ssl_anomalies_log              = (known after apply)
      + ssl_exemptions_log             = (known after apply)
      + ssl_negotiation_log            = (known after apply)
      + supported_alpn                 = (known after apply)
      + untrusted_caname               = (known after apply)
      + use_ssl_server                 = (known after apply)
      + whitelist                      = (known after apply)

      + https {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + invalid_server_cert         = (known after apply)
          + ports                       = "443"
          + proxy_after_tcp_handshake   = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + status                      = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }

      + ssh {
          + inspect_all               = (known after apply)
          + ports                     = (known after apply)
          + proxy_after_tcp_handshake = (known after apply)
          + ssh_algorithm             = (known after apply)
          + ssh_policy_check          = (known after apply)
          + ssh_tun_policy_check      = (known after apply)
          + status                    = "disable"
          + unsupported_version       = (known after apply)
        }

      + ssl {
          + cert_validation_failure     = (known after apply)
          + cert_validation_timeout     = (known after apply)
          + client_cert_request         = (known after apply)
          + client_certificate          = (known after apply)
          + expired_server_cert         = (known after apply)
          + inspect_all                 = "deep-inspection"
          + invalid_server_cert         = (known after apply)
          + revoked_server_cert         = (known after apply)
          + sni_server_cert_check       = (known after apply)
          + unsupported_ssl             = (known after apply)
          + unsupported_ssl_cipher      = (known after apply)
          + unsupported_ssl_negotiation = (known after apply)
          + untrusted_server_cert       = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_sslsshprofile.trname: Creating...
fortios_firewall_sslsshprofile.trname: Creation complete after 0s [id=test]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
```
# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_sslsshprofile.trname: Refreshing state... [id=test]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```
```
lbfirewall (test) # show
config firewall ssl-ssh-profile
    edit "test"
        config ssl
            set inspect-all deep-inspection
        end
        config https
        end
        config ftps
        end
        config imaps
        end
        config pop3s
        end
        config smtps
        end
        config ssh
            set ports 22
            set status disable
        end
        config dot
            set status disable
        end
        set server-cert-mode replace
        set server-cert "Fortinet_Factory"
    next
end
```
Thank you!